void game_txt_ru(const char* txt[])
{
	txt[TXT_ID_WELCOME] = "Добро пожаловать текст";

	txt[TXT_ID_CONTINUE] = "Продолжить";

	txt[TXT_ID_ACCEPT] = "Принять";
	txt[TXT_ID_CANCEL] = "Отментить";

	txt[TXT_ID_ENTER] = "Ввод";

	txt[TXT_ID_LOGIN] = "Войти";
	txt[TXT_ID_REGISTER] = "Регистрация";

	txt[TXT_ID_LOG_IN] = "ВОЙТИ";
	txt[TXT_ID_SIGN_UP] = "РЕГИСТРАЦИЯ";

	txt[TXT_ID_USER_NAME] = "ИМЯ ПОЛЬЗОВАТЕЛЯ";
	txt[TXT_ID_PASSWORD] = "ПАРОЛЬ";

	txt[TXT_ID_PASSWORD_AGAIN] = "ПАРОЛЬ ЕЩЕ РАЗ";
	txt[TXT_ID_EMAIL] = "ЭЛЕКТРОННАЯ ПОЧТА";

	txt[TXT_ID_INCORRECT_EMAIL] = "Неверный адрес ЭЛЕКТРОННОЙ ПОЧТЫ. Пожалуйста, проверьте введенный вами адрес ЭЛЕКТРОННОЙ ПОЧТЫ и повторите попытку.";

	txt[TXT_ID_USERNAME_TAKEN] = "Введенное вами ИМЯ ПОЛЬЗОВАТЕЛЯ уже занято. Пожалуйста, попробуйте другое ИМЯ ПОЛЬЗОВАТЕЛЯ.";

	txt[TXT_ID_USER_NAME_RULES] = "ИМЯ ПОЛЬЗОВАТЕЛЯ должно начинаться с заглавной буквы (A - Z).\nИМЯ ПОЛЬЗОВАТЕЛЯ может содержать строчные буквы (a - z) или цифры (0 - 9).\nОбщая длина ИМЕНИ ПОЛЬЗОВАТЕЛЯ должна быть не менее 3 символов и не превышать 10 символов.";

	txt[TXT_ID_NO_USER_OR_PASSWORD] = "Не найден аккаунт с указанным ИМЕНЕМ ПОЛЬЗОВАТЕЛЯ и ПАРОЛЕМ. Пожалуйста, введите свои учетные данные или зарегистрируйтесь.";
};
