void game_txt_ru(const char* txt[])
{
	txt[TXT_ID_WELCOME] = "ƒобро пожаловать текст";

	txt[TXT_ID_CONTINUE] = "ѕродолжить";

	txt[TXT_ID_ACCEPT] = "ѕрин€ть";
	txt[TXT_ID_CANCEL] = "ќтментить";

	txt[TXT_ID_ENTER] = "¬вод";

	txt[TXT_ID_LOGIN] = "¬ойти";
	txt[TXT_ID_REGISTER] = "–егистраци€";

	txt[TXT_ID_LOG_IN] = "¬ќ…“»";
	txt[TXT_ID_SIGN_UP] = "–≈√»—“–ј÷»я";

	txt[TXT_ID_USER_NAME] = "»ћя ѕќЋ№«ќ¬ј“≈Ћя";
	txt[TXT_ID_PASSWORD] = "ѕј–ќЋ№";

	txt[TXT_ID_PASSWORD_AGAIN] = "ѕј–ќЋ№ ≈ў≈ –ј«";
	txt[TXT_ID_EMAIL] = "ЁЋ≈ “–ќЌЌјя ѕќ„“ј";

	txt[TXT_ID_INCORRECT_EMAIL] = "Ќеверный адрес ЁЋ≈ “–ќЌЌќ… ѕќ„“џ. ѕожалуйста, проверьте введенный вами адрес ЁЋ≈ “–ќЌЌќ… ѕќ„“џ и повторите попытку.";

	txt[TXT_ID_USERNAME_TAKEN] = "¬веденное вами »ћя ѕќЋ№«ќ¬ј“≈Ћя уже зан€то. ѕожалуйста, попробуйте другое »ћя ѕќЋ№«ќ¬ј“≈Ћя.";

	txt[TXT_ID_NO_USER_OR_PASSWORD] = "Ќе найден аккаунт с указанным »ћ≈Ќ≈ћ ѕќЋ№«ќ¬ј“≈Ћя и ѕј–ќЋ≈ћ. ѕожалуйста, введите свои учетные данные или зарегистрируйтесь.";

	txt[TXT_ID_USER_NAME_RULES] = "»ћя ѕќЋ№«ќ¬ј“≈Ћя должно начинатьс€ с заглавной буквы (A - Z), за которой следуют строчные буквы (a - z) или цифры (0 - 9).\nќбща€ длина »ћ≈Ќ» ѕќЋ№«ќ¬ј“≈Ћя должна быть не менее 3 символов и не превышать 10 символов.";

	txt[TXT_ID_PASSWORD_RULES] = "ѕј–ќЋ№ должен быть минимум 6 символа максимум 20 символов.\n—одержать символы (a - z) и (A - Z), а также цифры (0 - 9).";

	txt[TXT_ID_EMAIL_RULES] = "јƒ–≈— ЁЋ≈ “–ќЌЌќ… ѕќ„“џ может содержать буквы (a - z) или (A - Z), цифры (0 - 9) и эти специальные символы: точка (.), подчеркивание (_), тире (-) и символ собаки (@). ƒругие символы не допускаютс€.";	

};
